app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `password_digest`) VALUES ('Duy Nguyen', 'duynn.mta@gmail.com', '$2a$10$ILXVB6b4cdgnApqEwGjofeKWlSLQ2VgupSTiY4ByKLm45G2ct5GJK')
---
  def create
    @user = User.new user_params
    if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 'signup' LIMIT 1
---
  def get_users
    @user = User.find_by id: params[:id]